




const dependences = [



	// масиви-списки з інших сайтів ( сторонні ) ----------------------------------------------------------------------------------
	
		// https://pillypenkosa.github.io/   ${ k.site }   /list/list.   ${ k.db }   .js
	
	{ db: 'country' 	, site: 'db' 		, },
	{ db: 'people' 		, site: 'media' 	, },  





	// масиви-списки з ЦЬОГО проекту ( свої ) -------------------------------------------------------------------------------------

	{ arr: 'hashtag' 		, },
	{ arr: 'franchise' 		, },
	{ arr: 'selection' 		, },
	{ arr: 'films' 			, },	





	// сервіси ---------------------------------------------------------------------------------------------------------------------

	//{ service: 'prepare' 			, },
	



	// компоненти загальні --------------------------------------------------------------------------------------------------------


	{ cmp: 'Win-Err404' 		, },
	{ cmp: 'Footer' 			, },
	{ cmp: 'Cast' 				, },
	{ cmp: 'Menu' 				, },
	{ cmp: 'Header' 			, },

	{ cmp: 'Franchise' 			, },







	// компоненти-контенти // win-сторiнки ----------------------------------------------------------------------------------------
	
	{ cmp: 'Win-Index' 					, regexp: /^index$/ 					, }, 	// regexp - url-маршрут (route) в адресному рядку



	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9]+$/ 				, }, 	// user/{ n }
	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9A-Za-z]+$/ 		, }, 	// user/{ txt }
	//{ cmp: 'Win-Users' 			, regexp: /^users$/ 					, },










];




















